MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX150F128D.atdf
      <value-group caption="JTAG Port Enable bit" name="DEVCFG0__JTAGEN">
         <value caption="JTAG Port Enabled" name="ON" value="0x1" />
         <value caption="JTAG Disabled" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="In-Circuit Emulator/Debugger Communication Channel Select bits" name="DEVCFG0__ICESEL">
         <value caption="Communicate on PGEC1/PGED1" name="ICS_PGx1" value="0x3" />
         <value caption="Communicate on PGEC2/PGED2" name="ICS_PGx2" value="0x2" />
         <value caption="Communicate on PGEC3/PGED3" name="ICS_PGx3" value="0x1" />
         <value caption="Communicate on PGEC4/PGED4" name="ICS_PGx4" value="0x0" />
      </value-group>
      <value-group caption="Program Flash Write-Protect bits" name="DEVCFG0__PWP">
         <value caption="Disable" name="OFF" value="0x1ff" />
         <value caption="First 1K" name="PWP1K" value="0x1fe" />
         <value caption="First 2K" name="PWP2K" value="0x1fd" />
         <value caption="First 3K" name="PWP3K" value="0x1fc" />
         <value caption="First 4K" name="PWP4K" value="0x1fb" />
         <value caption="First 5K" name="PWP5K" value="0x1fa" />
         <value caption="First 6K" name="PWP6K" value="0x1f9" />
         <value caption="First 7K" name="PWP7K" value="0x1f8" />
         <value caption="First 8K" name="PWP8K" value="0x1f7" />
         <value caption="First 9K" name="PWP9K" value="0x1f6" />
         <value caption="First 10K" name="PWP10K" value="0x1f5" />
         <value caption="First 11K" name="PWP11K" value="0x1f4" />
         <value caption="First 12K" name="PWP12K" value="0x1f3" />
         <value caption="First 13K" name="PWP13K" value="0x1f2" />
         <value caption="First 14K" name="PWP14K" value="0x1f1" />
         <value caption="First 15K" name="PWP15K" value="0x1f0" />
         <value caption="First 16K" name="PWP16K" value="0x1ef" />
         <value caption="First 17K" name="PWP17K" value="0x1ee" />
         <value caption="First 18K" name="PWP18K" value="0x1ed" />
         <value caption="First 19K" name="PWP19K" value="0x1ec" />
         <value caption="First 20K" name="PWP20K" value="0x1eb" />
         <value caption="First 21K" name="PWP21K" value="0x1ea" />
         <value caption="First 22K" name="PWP22K" value="0x1e9" />
         <value caption="First 23K" name="PWP23K" value="0x1e8" />
         <value caption="First 24K" name="PWP24K" value="0x1e7" />
         <value caption="First 25K" name="PWP25K" value="0x1e6" />
         <value caption="First 26K" name="PWP26K" value="0x1e5" />
         <value caption="First 27K" name="PWP27K" value="0x1e4" />
         <value caption="First 28K" name="PWP28K" value="0x1e3" />
         <value caption="First 29K" name="PWP29K" value="0x1e2" />
         <value caption="First 30K" name="PWP30K" value="0x1e1" />
         <value caption="First 31K" name="PWP31K" value="0x1e0" />
         <value caption="First 32K" name="PWP32K" value="0x1df" />
         <value caption="First 33K" name="PWP33K" value="0x1de" />
         <value caption="First 34K" name="PWP34K" value="0x1dd" />
         <value caption="First 35K" name="PWP35K" value="0x1dc" />
         <value caption="First 36K" name="PWP36K" value="0x1db" />
         <value caption="First 37K" name="PWP37K" value="0x1da" />
         <value caption="First 38K" name="PWP38K" value="0x1d9" />
         <value caption="First 39K" name="PWP39K" value="0x1d8" />
         <value caption="First 40K" name="PWP40K" value="0x1d7" />
         <value caption="First 41K" name="PWP41K" value="0x1d6" />
         <value caption="First 42K" name="PWP42K" value="0x1d5" />
         <value caption="First 43K" name="PWP43K" value="0x1d4" />
         <value caption="First 44K" name="PWP44K" value="0x1d3" />
         <value caption="First 45K" name="PWP45K" value="0x1d2" />
         <value caption="First 46K" name="PWP46K" value="0x1d1" />
         <value caption="First 47K" name="PWP47K" value="0x1d0" />
         <value caption="First 48K" name="PWP48K" value="0x1cf" />
         <value caption="First 49K" name="PWP49K" value="0x1ce" />
         <value caption="First 50K" name="PWP50K" value="0x1cd" />
         <value caption="First 51K" name="PWP51K" value="0x1cc" />
         <value caption="First 52K" name="PWP52K" value="0x1cb" />
         <value caption="First 53K" name="PWP53K" value="0x1ca" />
         <value caption="First 54K" name="PWP54K" value="0x1c9" />
         <value caption="First 55K" name="PWP55K" value="0x1c8" />
         <value caption="First 56K" name="PWP56K" value="0x1c7" />
         <value caption="First 57K" name="PWP57K" value="0x1c6" />
         <value caption="First 58K" name="PWP58K" value="0x1c5" />
         <value caption="First 59K" name="PWP59K" value="0x1c4" />
         <value caption="First 60K" name="PWP60K" value="0x1c3" />
         <value caption="First 61K" name="PWP61K" value="0x1c2" />
         <value caption="First 62K" name="PWP62K" value="0x1c1" />
         <value caption="First 63K" name="PWP63K" value="0x1c0" />
         <value caption="First 64K" name="PWP64K" value="0x1bf" />
         <value caption="First 65K" name="PWP65K" value="0x1be" />
         <value caption="First 66K" name="PWP66K" value="0x1bd" />
         <value caption="First 67K" name="PWP67K" value="0x1bc" />
         <value caption="First 68K" name="PWP68K" value="0x1bb" />
         <value caption="First 69K" name="PWP69K" value="0x1ba" />
         <value caption="First 70K" name="PWP70K" value="0x1b9" />
         <value caption="First 71K" name="PWP71K" value="0x1b8" />
         <value caption="First 72K" name="PWP72K" value="0x1b7" />
         <value caption="First 73K" name="PWP73K" value="0x1b6" />
         <value caption="First 74K" name="PWP74K" value="0x1b5" />
         <value caption="First 75K" name="PWP75K" value="0x1b4" />
         <value caption="First 76K" name="PWP76K" value="0x1b3" />
         <value caption="First 77K" name="PWP77K" value="0x1b2" />
         <value caption="First 78K" name="PWP78K" value="0x1b1" />
         <value caption="First 79K" name="PWP79K" value="0x1b0" />
         <value caption="First 80K" name="PWP80K" value="0x1af" />
         <value caption="First 81K" name="PWP81K" value="0x1ae" />
         <value caption="First 82K" name="PWP82K" value="0x1ad" />
         <value caption="First 83K" name="PWP83K" value="0x1ac" />
         <value caption="First 84K" name="PWP84K" value="0x1ab" />
         <value caption="First 85K" name="PWP85K" value="0x1aa" />
         <value caption="First 86K" name="PWP86K" value="0x1a9" />
         <value caption="First 87K" name="PWP87K" value="0x1a8" />
         <value caption="First 88K" name="PWP88K" value="0x1a7" />
         <value caption="First 89K" name="PWP89K" value="0x1a6" />
         <value caption="First 90K" name="PWP90K" value="0x1a5" />
         <value caption="First 91K" name="PWP91K" value="0x1a4" />
         <value caption="First 92K" name="PWP92K" value="0x1a3" />
         <value caption="First 93K" name="PWP93K" value="0x1a2" />
         <value caption="First 94K" name="PWP94K" value="0x1a1" />
         <value caption="First 95K" name="PWP95K" value="0x1a0" />
         <value caption="First 96K" name="PWP96K" value="0x19f" />
         <value caption="First 97K" name="PWP97K" value="0x19e" />
         <value caption="First 98K" name="PWP98K" value="0x19d" />
         <value caption="First 99K" name="PWP99K" value="0x19c" />
         <value caption="First 100K" name="PWP100K" value="0x19b" />
         <value caption="First 101K" name="PWP101K" value="0x19a" />
         <value caption="First 102K" name="PWP102K" value="0x199" />
         <value caption="First 103K" name="PWP103K" value="0x198" />
         <value caption="First 104K" name="PWP104K" value="0x197" />
         <value caption="First 105K" name="PWP105K" value="0x196" />
         <value caption="First 106K" name="PWP106K" value="0x195" />
         <value caption="First 107K" name="PWP107K" value="0x194" />
         <value caption="First 108K" name="PWP108K" value="0x193" />
         <value caption="First 109K" name="PWP109K" value="0x192" />
         <value caption="First 110K" name="PWP110K" value="0x191" />
         <value caption="First 111K" name="PWP111K" value="0x190" />
         <value caption="First 112K" name="PWP112K" value="0x18f" />
         <value caption="First 113K" name="PWP113K" value="0x18e" />
         <value caption="First 114K" name="PWP114K" value="0x18d" />
         <value caption="First 115K" name="PWP115K" value="0x18c" />
         <value caption="First 116K" name="PWP116K" value="0x18b" />
         <value caption="First 117K" name="PWP117K" value="0x18a" />
         <value caption="First 118K" name="PWP118K" value="0x189" />
         <value caption="First 119K" name="PWP119K" value="0x188" />
         <value caption="First 120K" name="PWP120K" value="0x187" />
         <value caption="First 121K" name="PWP121K" value="0x186" />
         <value caption="First 122K" name="PWP122K" value="0x185" />
         <value caption="First 123K" name="PWP123K" value="0x184" />
         <value caption="First 124K" name="PWP124K" value="0x183" />
         <value caption="First 125K" name="PWP125K" value="0x182" />
         <value caption="First 126K" name="PWP126K" value="0x181" />
         <value caption="First 127K" name="PWP127K" value="0x180" />
         <value caption="First 128K" name="PWP128K" value="0x17f" />
         <value caption="First 129K" name="PWP129K" value="0x17e" />
         <value caption="First 130K" name="PWP130K" value="0x17d" />
         <value caption="First 131K" name="PWP131K" value="0x17c" />
         <value caption="First 132K" name="PWP132K" value="0x17b" />
         <value caption="First 133K" name="PWP133K" value="0x17a" />
         <value caption="First 134K" name="PWP134K" value="0x179" />
         <value caption="First 135K" name="PWP135K" value="0x178" />
         <value caption="First 136K" name="PWP136K" value="0x177" />
         <value caption="First 137K" name="PWP137K" value="0x176" />
         <value caption="First 138K" name="PWP138K" value="0x175" />
         <value caption="First 139K" name="PWP139K" value="0x174" />
         <value caption="First 140K" name="PWP140K" value="0x173" />
         <value caption="First 141K" name="PWP141K" value="0x172" />
         <value caption="First 142K" name="PWP142K" value="0x171" />
         <value caption="First 143K" name="PWP143K" value="0x170" />
         <value caption="First 144K" name="PWP144K" value="0x16f" />
         <value caption="First 145K" name="PWP145K" value="0x16e" />
         <value caption="First 146K" name="PWP146K" value="0x16d" />
         <value caption="First 147K" name="PWP147K" value="0x16c" />
         <value caption="First 148K" name="PWP148K" value="0x16b" />
         <value caption="First 149K" name="PWP149K" value="0x16a" />
         <value caption="First 150K" name="PWP150K" value="0x169" />
         <value caption="First 151K" name="PWP151K" value="0x168" />
         <value caption="First 152K" name="PWP152K" value="0x167" />
         <value caption="First 153K" name="PWP153K" value="0x166" />
         <value caption="First 154K" name="PWP154K" value="0x165" />
         <value caption="First 155K" name="PWP155K" value="0x164" />
         <value caption="First 156K" name="PWP156K" value="0x163" />
         <value caption="First 157K" name="PWP157K" value="0x162" />
         <value caption="First 158K" name="PWP158K" value="0x161" />
         <value caption="First 159K" name="PWP159K" value="0x160" />
         <value caption="First 160K" name="PWP160K" value="0x15f" />
         <value caption="First 161K" name="PWP161K" value="0x15e" />
         <value caption="First 162K" name="PWP162K" value="0x15d" />
         <value caption="First 163K" name="PWP163K" value="0x15c" />
         <value caption="First 164K" name="PWP164K" value="0x15b" />
         <value caption="First 165K" name="PWP165K" value="0x15a" />
         <value caption="First 166K" name="PWP166K" value="0x159" />
         <value caption="First 167K" name="PWP167K" value="0x158" />
         <value caption="First 168K" name="PWP168K" value="0x157" />
         <value caption="First 169K" name="PWP169K" value="0x156" />
         <value caption="First 170K" name="PWP170K" value="0x155" />
         <value caption="First 171K" name="PWP171K" value="0x154" />
         <value caption="First 172K" name="PWP172K" value="0x153" />
         <value caption="First 173K" name="PWP173K" value="0x152" />
         <value caption="First 174K" name="PWP174K" value="0x151" />
         <value caption="First 175K" name="PWP175K" value="0x150" />
         <value caption="First 176K" name="PWP176K" value="0x14f" />
         <value caption="First 177K" name="PWP177K" value="0x14e" />
         <value caption="First 178K" name="PWP178K" value="0x14d" />
         <value caption="First 179K" name="PWP179K" value="0x14c" />
         <value caption="First 180K" name="PWP180K" value="0x14b" />
         <value caption="First 181K" name="PWP181K" value="0x14a" />
         <value caption="First 182K" name="PWP182K" value="0x149" />
         <value caption="First 183K" name="PWP183K" value="0x148" />
         <value caption="First 184K" name="PWP184K" value="0x147" />
         <value caption="First 185K" name="PWP185K" value="0x146" />
         <value caption="First 186K" name="PWP186K" value="0x145" />
         <value caption="First 187K" name="PWP187K" value="0x144" />
         <value caption="First 188K" name="PWP188K" value="0x143" />
         <value caption="First 189K" name="PWP189K" value="0x142" />
         <value caption="First 190K" name="PWP190K" value="0x141" />
         <value caption="First 191K" name="PWP191K" value="0x140" />
         <value caption="First 192K" name="PWP192K" value="0x13f" />
         <value caption="First 193K" name="PWP193K" value="0x13e" />
         <value caption="First 194K" name="PWP194K" value="0x13d" />
         <value caption="First 195K" name="PWP195K" value="0x13c" />
         <value caption="First 196K" name="PWP196K" value="0x13b" />
         <value caption="First 197K" name="PWP197K" value="0x13a" />
         <value caption="First 198K" name="PWP198K" value="0x139" />
         <value caption="First 199K" name="PWP199K" value="0x138" />
         <value caption="First 200K" name="PWP200K" value="0x137" />
         <value caption="First 201K" name="PWP201K" value="0x136" />
         <value caption="First 202K" name="PWP202K" value="0x135" />
         <value caption="First 203K" name="PWP203K" value="0x134" />
         <value caption="First 204K" name="PWP204K" value="0x133" />
         <value caption="First 205K" name="PWP205K" value="0x132" />
         <value caption="First 206K" name="PWP206K" value="0x131" />
         <value caption="First 207K" name="PWP207K" value="0x130" />
         <value caption="First 208K" name="PWP208K" value="0x12f" />
         <value caption="First 209K" name="PWP209K" value="0x12e" />
         <value caption="First 210K" name="PWP210K" value="0x12d" />
         <value caption="First 211K" name="PWP211K" value="0x12c" />
         <value caption="First 212K" name="PWP212K" value="0x12b" />
         <value caption="First 213K" name="PWP213K" value="0x12a" />
         <value caption="First 214K" name="PWP214K" value="0x129" />
         <value caption="First 215K" name="PWP215K" value="0x128" />
         <value caption="First 216K" name="PWP216K" value="0x127" />
         <value caption="First 217K" name="PWP217K" value="0x126" />
         <value caption="First 218K" name="PWP218K" value="0x125" />
         <value caption="First 219K" name="PWP219K" value="0x124" />
         <value caption="First 220K" name="PWP220K" value="0x123" />
         <value caption="First 221K" name="PWP221K" value="0x122" />
         <value caption="First 222K" name="PWP222K" value="0x121" />
         <value caption="First 223K" name="PWP223K" value="0x120" />
         <value caption="First 224K" name="PWP224K" value="0x11f" />
         <value caption="First 225K" name="PWP225K" value="0x11e" />
         <value caption="First 226K" name="PWP226K" value="0x11d" />
         <value caption="First 227K" name="PWP227K" value="0x11c" />
         <value caption="First 228K" name="PWP228K" value="0x11b" />
         <value caption="First 229K" name="PWP229K" value="0x11a" />
         <value caption="First 230K" name="PWP230K" value="0x119" />
         <value caption="First 231K" name="PWP231K" value="0x118" />
         <value caption="First 232K" name="PWP232K" value="0x117" />
         <value caption="First 233K" name="PWP233K" value="0x116" />
         <value caption="First 234K" name="PWP234K" value="0x115" />
         <value caption="First 235K" name="PWP235K" value="0x114" />
         <value caption="First 236K" name="PWP236K" value="0x113" />
         <value caption="First 237K" name="PWP237K" value="0x112" />
         <value caption="First 238K" name="PWP238K" value="0x111" />
         <value caption="First 239K" name="PWP239K" value="0x110" />
         <value caption="First 240K" name="PWP240K" value="0x10f" />
         <value caption="First 241K" name="PWP241K" value="0x10e" />
         <value caption="First 242K" name="PWP242K" value="0x10d" />
         <value caption="First 243K" name="PWP243K" value="0x10c" />
         <value caption="First 244K" name="PWP244K" value="0x10b" />
         <value caption="First 245K" name="PWP245K" value="0x10a" />
         <value caption="First 246K" name="PWP246K" value="0x109" />
         <value caption="First 247K" name="PWP247K" value="0x108" />
         <value caption="First 248K" name="PWP248K" value="0x107" />
         <value caption="First 249K" name="PWP249K" value="0x106" />
         <value caption="First 250K" name="PWP250K" value="0x105" />
         <value caption="First 251K" name="PWP251K" value="0x104" />
         <value caption="First 252K" name="PWP252K" value="0x103" />
         <value caption="First 253K" name="PWP253K" value="0x102" />
         <value caption="First 254K" name="PWP254K" value="0x101" />
         <value caption="First 255K" name="PWP255K" value="0x100" />
         <value caption="First 256K" name="PWP256K" value="0xff" />
      </value-group>
      <value-group caption="Boot Flash Write-Protect bit" name="DEVCFG0__BWP">
         <value caption="Boot Flash is not writable" name="ON" value="0x0" />
         <value caption="Boot Flash is writable" name="OFF" value="0x1" />
      </value-group>
      <value-group caption="Code-Protect bit" name="DEVCFG0__CP">
         <value caption="Protection Enabled" name="ON" value="0x0" />
         <value caption="Protection Disabled" name="OFF" value="0x1" />
      </value-group>
   </module>
